# data-database-types-relational-language-SQL-MySQL-function-built-in-aggregate-clause-GROUP-BY
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **often** **used** **with** - **aggregate** **functions** - **COUNT** - **MAX** - **MIN** - **SUM** - **AVG** - to **group** the **result** - **set** by **one** or **more** **columns** - attributes - fields [1]

```sql
mysql> use school;
Database changed
```

```sql
mysql> show tables;
+------------------+
| Tables_in_school |
+------------------+
| subject          |
| teacher          |
+------------------+
2 rows in set (0.00 sec)
```

- aggregate function - AVG - obtain average of column - attribute - field - experience - average experience of teachers [1]

```sql
mysql> SELECT AVG(experience)
    -> FROM teacher;
+-----------------+
| AVG(experience) |
+-----------------+
|         32.5714 |
+-----------------+
1 row in set (0.01 sec)
```

- each teacher is qualified to teach to a certain column - attribute - field - level - value - J - junior cert - value - L - leaving cert [1]

```sql
mysql> SELECT *
    -> FROM teacher;
+-----+--------------+-------+------------+------------+
| tid | Name         | level | experience | dob        |
+-----+--------------+-------+------------+------------+
|   1 | Mr. Pasteur  | L     |         15 | 1960-02-02 |
|   2 | Ms. Dubois   | L     |         22 | 1967-09-02 |
|   3 | Ms. Smith    | J     |          4 | 1980-03-23 |
|   4 | Mr. Hawking  | L     |         40 | 1951-02-19 |
|   5 | Mr. Kavanagh | J     |         50 | 1949-11-01 |
|   6 | Mr. Picasso  | J     |         42 | 1939-03-30 |
|   7 | Fr. Lynch    | L     |         55 | 1939-03-31 |
+-----+--------------+-------+------------+------------+
7 rows in set (0.00 sec)
```

- average columnn - attribute - field - experience - for each column - attribute - field - level - the level a teacher can teach - clause - GROUP BY - grouping the average of each level - either junior cert - leaving cert [1]

```sql
mysql> SELECT level,AVG(experience)
    -> FROM teacher
    -> GROUP BY level;
+-------+-----------------+
| level | AVG(experience) |
+-------+-----------------+
| L     |         33.0000 |
| J     |         32.0000 |
+-------+-----------------+
2 rows in set (0.00 sec)
```

```sql
mysql> use lab5;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab5 |
+----------------+
| car            |
| person         |
+----------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM car;
+--------------+--------+------------+--------+---------+------------+
| registration | make   | model      | colour | mileage | engineSize |
+--------------+--------+------------+--------+---------+------------+
| 05-MO-17931  | Toyota | Highlander | Green  |  253789 |        1.6 |
| 10-G-2334    | Toyota | Corolla    | Green  |  123389 |        1.3 |
| 10-WH-17931  | Toyota | Corolla    | Silver |  130389 |        1.4 |
| 11-MO-23431  | Toyota | Corolla    | Black  | 1234123 |        1.3 |
| 12-WH-123    | Ford   | Ka         | Black  |  125882 |        1.0 |
| 132-G-9923   | Ford   | Ka         | Silver |  325883 |        1.0 |
| 132-MO-19323 | Ford   | Galaxy     | Silver |    2343 |        1.5 |
| 171-G-39532  | Toyota | Corolla    | Silver |   55882 |        1.3 |
| 171-MO-12533 | Ford   | Fiesta     | Black  |   25882 |        1.0 |
| 99-G-300     | Toyota | Corolla    | Green  |  599339 |        1.3 |
+--------------+--------+------------+--------+---------+------------+
10 rows in set (0.00 sec)
```

- average columnn - attribute - field - mileage - for all cars round to the nearest whole number - alias - KMs [1]

```sql
mysql> SELECT ROUND(AVG(mileage)) as KMs
    -> FROM car;
+--------+
| KMs    |
+--------+
| 287690 |
+--------+
1 row in set (0.00 sec)
```

- average columnn - attribute - field - mileage - for each column - attribute - field - model - of car round to the nearest whole number - alias - KMs - clause - GROUP BY - round average for each individual column - attribute - field - model [1]

```sql
mysql> SELECT model,ROUND(AVG(mileage)) as KMs
    -> FROM car
    -> GROUP BY model;
+------------+--------+
| model      | KMs    |
+------------+--------+
| Highlander | 253789 |
| Corolla    | 428624 |
| Ka         | 225883 |
| Galaxy     |   2343 |
| Fiesta     |  25882 |
+------------+--------+
5 rows in set (0.00 sec)
```

- average columnn - attribute - field - mileage - for each column - attribute - field - model - of car round to the nearest whole number - clause - WHERE - column - attribute - field - mileage - greater than sixty-thousand - alias - KMs - clause - GROUP BY - round average for each individual column - attribute - field - model - not included in the overall average based on column - attribute - field - model - value - Corolla - is row - record - tuple - 171-G-39532 - column - attribute - field - value - 55882 - average calculated for four corollas albeit five rows - records - tuples - exist [1]

```sql
mysql> SELECT model,ROUND(AVG(mileage)) as KMs
    -> FROM car
    -> WHERE mileage>60000
    -> GROUP BY model;
+------------+--------+
| model      | KMs    |
+------------+--------+
| Highlander | 253789 |
| Corolla    | 521810 |
| Ka         | 225883 |
+------------+--------+
3 rows in set (0.00 sec)
```

***
# END